vault/v3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front_and_back
    {
        type            empty;
        physicalType    empty;
        nFaces          148752;
        startFace       111205;
    }
    tunnel
    {
        type            patch;
        physicalType    patch;
        nFaces          86;
        startFace       259957;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          42;
        startFace       260043;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          42;
        startFace       260085;
    }
    wing
    {
        type            wall;
        physicalType    wall;
        nFaces          548;
        startFace       260127;
    }
)

// ************************************************************************* //
