vault/v3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration true;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
    }

    p
    {
        $pcorr
        tolerance        1e-6;
        relTol           0.001;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.001;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    1;
    nCorrectors         4;
    // nCorrectors is absolutely necessary! 
    // On a multi-element airfoil, I tested with nCorrectors=1 and the pressure 
    // distribution looked totally unphysical. Setting nCorrectors=3 made a 
    // dramatic difference. 
    nNonOrthogonalCorrectors 1;
	pRefCell	0;
	pRefValue	0;
}

relaxationFactors
{
    fields
    {
        p               0.2;
    }
    equations
    {
        "(U|k|omega)"   0.4;
        "(U|k|omega)Final" 0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
